app/controllers/admin_controller.rb

  def index
    @cash = CashMachine.find(1)
---
SELECT "cash_machines".* FROM "cash_machines" WHERE "cash_machines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @cash = CashMachine.find(1)

    unless params[:commit].nil?
      hash = params.require(:admin).permit(:cash_amount)
      cash_amount = check_input(hash[:cash_amount])
      if cash_amount.nil?
        cash_amount = hash[:cash_amount].to_f

        CashMachine.update_cash(cash_amount, @cash)
---
SELECT "cash_machines".* FROM "cash_machines" WHERE "cash_machines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cash_machines" SET "cash_amount" = $1, "updated_at" = $2 WHERE "cash_machines"."id" = $3  [["cash_amount", 15000.0], ["updated_at", "2020-11-13 20:51:15.198745"], ["id", 1]]