app/controllers/user_controller.rb

  def index
    @user = User.find(current_user.id)

    @record = @user.users_history_record.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users_history_records".* FROM "users_history_records" WHERE "users_history_records"."user_id" = $1  [["user_id", 1]]

  def create
    @user = User.find(current_user.id)

    @record = @user.users_history_record.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users_history_records".* FROM "users_history_records" WHERE "users_history_records"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def operate(hash)
    @user = User.find(current_user.id)

    if User.operate(hash, @user)
      @record = @user.users_history_record.build(operation_type: hash[:commit], amount: hash[:current_balance], balance_after: @user.current_balance)

      @record.save! ? true : false
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "users_history_records" ("operation_type", "amount", "balance_after", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["operation_type", "Withdraw"], ["amount", 3.0], ["balance_after", 8978.0], ["created_at", "2020-12-12 12:57:54.566839"], ["updated_at", "2020-12-12 12:57:54.566839"], ["user_id", 3]]