app/models/cash_machine.rb

  def self.add_cash(amount)
    @machine = CashMachine.find(1)
    new_amount = (@machine.cash_amount + amount)

    if new_amount == Float::INFINITY || new_amount == Float::MAX
      false

    else
      @machine.cash_amount = new_amount
      @machine.save!
---
SELECT "cash_machines".* FROM "cash_machines" WHERE "cash_machines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cash_machines" SET "cash_amount" = $1, "updated_at" = $2 WHERE "cash_machines"."id" = $3  [["cash_amount", 9911.0], ["updated_at", "2020-12-12 21:52:32.654068"], ["id", 1]]

  def self.cash_available?(amount)
    @machine = CashMachine.find(1)

    new_amount = (@machine.cash_amount - amount)

    if new_amount < 0.0
      false

    else
      @machine.cash_amount = new_amount
      @machine.save!
---
SELECT "cash_machines".* FROM "cash_machines" WHERE "cash_machines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cash_machines" SET "cash_amount" = $1, "updated_at" = $2 WHERE "cash_machines"."id" = $3  [["cash_amount", 135000.0], ["updated_at", "2020-12-15 18:51:18.790161"], ["id", 1]]

  def self.update_cash(amount, cash)
    cash.cash_amount =  amount

    cash.save! ? true : false
---
UPDATE "cash_machines" SET "cash_amount" = $1, "updated_at" = $2 WHERE "cash_machines"."id" = $3  [["cash_amount", 10000.0], ["updated_at", "2020-12-12 17:47:03.262239"], ["id", 1]]
UPDATE "cash_machines" SET "cash_amount" = $1, "updated_at" = $2 WHERE "cash_machines"."id" = $3  [["cash_amount", 10000.0], ["updated_at", "2020-12-12 17:56:31.919213"], ["id", 1]]