app/models/user.rb

  def self.withdraw(amount, user)
    substraction_result = user.current_balance - amount

    if substraction_result >= 0.0
      if CashMachine.cash_available?(amount)
        user.current_balance = substraction_result
        user.save! ? true : false
---
UPDATE "users" SET "current_balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["current_balance", 0.0], ["updated_at", "2020-12-12 18:29:12.943123"], ["id", 9]]

  def self.deposit(amount, user)
    if CashMachine.add_cash(amount)
      user.current_balance += amount
      user.save! ? true : false
---
UPDATE "users" SET "current_balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["current_balance", 4796800000077.0], ["updated_at", "2020-12-12 17:48:02.294664"], ["id", 8]]